[
    "Instructions for Optimizing Keywords for Rakuten Listings: Objective: Enhance search visibility and relevance of Rakuten listings through strategic keyword optimization, aligning with customer search behaviors and Rakuten's platform standards. The goal is to meticulously analyze and optimize the listing to attract a broader audience by leveraging a comprehensive set of keywords. 1. Comprehensive Review of Listing Elements: Initial Analysis: Start by examining the list of initial keywords, the product title, catch copy, and the product description. This review is essential for understanding the product’s key features and unique selling propositions. 2. Strategic Generation of 関連キーワード (Related Keywords): - Expansion with Synonyms and Related Terms: Use the initial keywords as a base and methodically expand this list by incorporating synonyms and related terms. Focus on including terms that highlight product specifications (size, material, color, age suitability) and any unique features or benefits not directly mentioned in the initial list. - Explicit Synonym Inclusion: It is important to add synonyms for key attributes and related terms that potential customers might use in their search queries. This step is vital for capturing a wide range of customer intents. 3. Detailed Keyword Categorization for Precision: - Ignored Keywords Because Not in Content: Identify and list any provided keywords not directly referenced or implied in the product description, marking N/A if none apply. - Used from List Although Not Directly in Content: Document the keywords from the initial list that have been included in the 関連キーワード (related keywords) section despite not appearing in the product's title, catch copy, or description. Indicate N/A if not applicable. - Inclusion of Synonyms/Similar Terms: Actively seek and list additional synonyms or closely related terms derived from the product content that were not part of the initial keyword set. This step is crucial for broadening the search visibility of the listing. 4. Ensure Coherence, Relevance, and Platform Compliance: Ensure all keywords and categorized lists are presented clearly and cohesively, adhering to Rakuten's preferred formatting. All terms must be directly relevant and accurately reflect the product to enhance searchability and meet Rakuten’s SEO standards. 5. Formatting: - Result should include 4 sections: 関連キーワード: (bold) followed by list (keywords separated by space) - Ignored Keywords Because Not in Content - Used from List Although Not Directly in Content - Inclusion of Synonyms/Similar Terms each one of 3 above is followed by list of keywords, one per line (or N/A). - No Explanatory Text: Exclude any form of explanatory text before, within, or after the listing of requested results. The response should be limited strictly to the output or data requested. - Adhere to Requested Structure: Follow the structure requested for the response meticulously. If the request specifies a list, provide only the list in the format and order requested without deviation. - Clear and Concise: Keep all listings clear, concise, and directly relevant to the instructions given. Unnecessary elaboration or deviation from the requested format is to be avoided. 6. Final Review for Comprehensive Coverage and Strategic Alignment: - Conduct a thorough review to ensure the keyword list is exhaustive and aligns with the strategic objective of maximizing search visibility on Rakuten. This includes a final check for completeness, relevance, and adherence to Rakuten’s SEO best practices. - Ensure that keywords incorporated into the 関連キーワード section are accurately identified as either directly mentioned in the listing content (title, catch copy, product description) or included based on their relevance to the product, without direct mention within the main text. to summarize, process should be: Initial Keyword Review: Start by reviewing the provided keywords. Determine their direct relevance to the product by checking if they or their close derivatives appear in the product title, catch copy, or description. Generating Related Keywords: Expand the initial keyword list by adding synonyms and related terms. Include only those terms that are directly associated with the product’s features, benefits, or use cases. Avoid adding general terms that are not specific to the product. Categorization of Keywords: List any keywords from the provided list that are not found in the product's title, catch copy, or description under 'Ignored Keywords Because Not in Content.' For 'Used from List Although Not Directly in Content,' include keywords that, while not explicitly mentioned, are closely related to the product's features or benefits and have been included in the related keywords section. Under 'Inclusion of Synonyms/Similar Terms,' list additional relevant terms derived from the listing content that expand the search visibility but were not included in the initial set. Final Check for Alignment and Relevance: EXTREMELY IMPORTANT Review the keyword lists to ensure they are exhaustive, relevant, and aligned with strategic objectives for maximizing search visibility. Adjust as necessary for coherence and compliance with Rakuten’s standards. End of Instructions, item: https://item.rakuten.co.jp/glv/nak-98/, keywords: nakatani 遮光, Upf50傘, あす楽 完全遮光日傘, キッズ 晴雨兼用 長傘 50, たたみやすい 長傘, レディース日傘 軽量150, 雨 長傘 ピンク, 雨晴兼用雨傘長傘, 雨晴傘, 雨晴長傘, 楽天日傘クーポン, 軽量日傘 長傘, 傘 レディース50, 傘50%off, 傘日傘兼用, 晴雨兼用傘軽量, 晴雨兼用長傘50cm, 晴雨兼用長傘レディス, 晴雨兼用長日傘, 晴用 傘, 長傘 50, 日雨兼用傘, 日傘 シワ に ならない, 日傘 ポイント20倍, 日傘 花びら, 日傘 最 安値, 日傘 初売り, 日傘 売れ筋, 日傘、値下げ, 日傘スーパーセール, 日傘セール, 日傘雨傘兼用傘, 日傘雨晴兼用軽量, 日傘兼用傘, 日傘長, 日傘長傘遮光率100%,, 日傘風に強い日傘. title: ＼マラソン終了まで店内全品ポイントUP／ 傘 雨傘 長傘 晴雨兼用 完全遮光 遮光率 100％ UVカット レディース 花びら傘 フレラ 軽量 50cm 日傘 912033 Nakatani 株式会社中谷. catch copy:【365日翌日配送対応】 正規販売店 Nakatani 傘 長傘 雨傘 50cm 晴雨兼用 軽い バイカラー ワンタッチ傘 ジャンプ式 コンパクトサイズ 日傘 女性 オシャレ ブランド 通勤 通学 紫外線対策"
]